GopalSaraf/Practicals/PSDL/include/proc/pic18f46k22.inc
// Register: VREFCON2
#define VREFCON2 VREFCON2
VREFCON2                                 equ 0F40h
// bitfield definitions
VREFCON2_DACR_POSN                       equ 0000h
VREFCON2_DACR_POSITION                   equ 0000h
VREFCON2_DACR_SIZE                       equ 0005h
VREFCON2_DACR_LENGTH                     equ 0005h
VREFCON2_DACR_MASK                       equ 001Fh
VREFCON2_DACR0_POSN                      equ 0000h
VREFCON2_DACR0_POSITION                  equ 0000h
VREFCON2_DACR0_SIZE                      equ 0001h
VREFCON2_DACR0_LENGTH                    equ 0001h
VREFCON2_DACR0_MASK                      equ 0001h
VREFCON2_DACR1_POSN                      equ 0001h
VREFCON2_DACR1_POSITION                  equ 0001h
VREFCON2_DACR1_SIZE                      equ 0001h
VREFCON2_DACR1_LENGTH                    equ 0001h
VREFCON2_DACR1_MASK                      equ 0002h
VREFCON2_DACR2_POSN                      equ 0002h
VREFCON2_DACR2_POSITION                  equ 0002h
VREFCON2_DACR2_SIZE                      equ 0001h
VREFCON2_DACR2_LENGTH                    equ 0001h
VREFCON2_DACR2_MASK                      equ 0004h
VREFCON2_DACR3_POSN                      equ 0003h
VREFCON2_DACR3_POSITION                  equ 0003h
VREFCON2_DACR3_SIZE                      equ 0001h
VREFCON2_DACR3_LENGTH                    equ 0001h
VREFCON2_DACR3_MASK                      equ 0008h
VREFCON2_DACR4_POSN                      equ 0004h
VREFCON2_DACR4_POSITION                  equ 0004h
VREFCON2_DACR4_SIZE                      equ 0001h
VREFCON2_DACR4_LENGTH                    equ 0001h
VREFCON2_DACR4_MASK                      equ 0010h

// Register: VREFCON1
#define VREFCON1 VREFCON1
VREFCON1                                 equ 0F41h
// bitfield definitions
VREFCON1_DACNSS_POSN                     equ 0000h
VREFCON1_DACNSS_POSITION                 equ 0000h
VREFCON1_DACNSS_SIZE                     equ 0001h
VREFCON1_DACNSS_LENGTH                   equ 0001h
VREFCON1_DACNSS_MASK                     equ 0001h
VREFCON1_DACPSS_POSN                     equ 0002h
VREFCON1_DACPSS_POSITION                 equ 0002h
VREFCON1_DACPSS_SIZE                     equ 0002h
VREFCON1_DACPSS_LENGTH                   equ 0002h
VREFCON1_DACPSS_MASK                     equ 000Ch
VREFCON1_DACOE_POSN                      equ 0005h
VREFCON1_DACOE_POSITION                  equ 0005h
VREFCON1_DACOE_SIZE                      equ 0001h
VREFCON1_DACOE_LENGTH                    equ 0001h
VREFCON1_DACOE_MASK                      equ 0020h
VREFCON1_DACLPS_POSN                     equ 0006h
VREFCON1_DACLPS_POSITION                 equ 0006h
VREFCON1_DACLPS_SIZE                     equ 0001h
VREFCON1_DACLPS_LENGTH                   equ 0001h
VREFCON1_DACLPS_MASK                     equ 0040h
VREFCON1_DACEN_POSN                      equ 0007h
VREFCON1_DACEN_POSITION                  equ 0007h
VREFCON1_DACEN_SIZE                      equ 0001h
VREFCON1_DACEN_LENGTH                    equ 0001h
VREFCON1_DACEN_MASK                      equ 0080h
VREFCON1_DACPSS0_POSN                    equ 0002h
VREFCON1_DACPSS0_POSITION                equ 0002h
VREFCON1_DACPSS0_SIZE                    equ 0001h
VREFCON1_DACPSS0_LENGTH                  equ 0001h
VREFCON1_DACPSS0_MASK                    equ 0004h
VREFCON1_DACPSS1_POSN                    equ 0003h
VREFCON1_DACPSS1_POSITION                equ 0003h
VREFCON1_DACPSS1_SIZE                    equ 0001h
VREFCON1_DACPSS1_LENGTH                  equ 0001h
VREFCON1_DACPSS1_MASK                    equ 0008h

// Register: VREFCON0
#define VREFCON0 VREFCON0
VREFCON0                                 equ 0F42h
// bitfield definitions
VREFCON0_FVRS_POSN                       equ 0004h
VREFCON0_FVRS_POSITION                   equ 0004h
VREFCON0_FVRS_SIZE                       equ 0002h
VREFCON0_FVRS_LENGTH                     equ 0002h
VREFCON0_FVRS_MASK                       equ 0030h
VREFCON0_FVRST_POSN                      equ 0006h
VREFCON0_FVRST_POSITION                  equ 0006h
VREFCON0_FVRST_SIZE                      equ 0001h
VREFCON0_FVRST_LENGTH                    equ 0001h
VREFCON0_FVRST_MASK                      equ 0040h
VREFCON0_FVREN_POSN                      equ 0007h
VREFCON0_FVREN_POSITION                  equ 0007h
VREFCON0_FVREN_SIZE                      equ 0001h
VREFCON0_FVREN_LENGTH                    equ 0001h
VREFCON0_FVREN_MASK                      equ 0080h
VREFCON0_FVRS0_POSN                      equ 0004h
VREFCON0_FVRS0_POSITION                  equ 0004h
VREFCON0_FVRS0_SIZE                      equ 0001h
VREFCON0_FVRS0_LENGTH                    equ 0001h
VREFCON0_FVRS0_MASK                      equ 0010h
VREFCON0_FVRS1_POSN                      equ 0005h
VREFCON0_FVRS1_POSITION                  equ 0005h
VREFCON0_FVRS1_SIZE                      equ 0001h
VREFCON0_FVRS1_LENGTH                    equ 0001h
VREFCON0_FVRS1_MASK                      equ 0020h

// Register: CTMUICON
#define CTMUICON CTMUICON
CTMUICON                                 equ 0F43h
// bitfield definitions
CTMUICON_IRNG_POSN                       equ 0000h
CTMUICON_IRNG_POSITION                   equ 0000h
CTMUICON_IRNG_SIZE                       equ 0002h
CTMUICON_IRNG_LENGTH                     equ 0002h
CTMUICON_IRNG_MASK                       equ 0003h
CTMUICON_ITRIM_POSN                      equ 0002h
CTMUICON_ITRIM_POSITION                  equ 0002h
CTMUICON_ITRIM_SIZE                      equ 0006h
CTMUICON_ITRIM_LENGTH                    equ 0006h
CTMUICON_ITRIM_MASK                      equ 00FCh
CTMUICON_IRNG0_POSN                      equ 0000h
CTMUICON_IRNG0_POSITION                  equ 0000h
CTMUICON_IRNG0_SIZE                      equ 0001h
CTMUICON_IRNG0_LENGTH                    equ 0001h
CTMUICON_IRNG0_MASK                      equ 0001h
CTMUICON_IRNG1_POSN                      equ 0001h
CTMUICON_IRNG1_POSITION                  equ 0001h
CTMUICON_IRNG1_SIZE                      equ 0001h
CTMUICON_IRNG1_LENGTH                    equ 0001h
CTMUICON_IRNG1_MASK                      equ 0002h
CTMUICON_ITRIM0_POSN                     equ 0002h
CTMUICON_ITRIM0_POSITION                 equ 0002h
CTMUICON_ITRIM0_SIZE                     equ 0001h
CTMUICON_ITRIM0_LENGTH                   equ 0001h
CTMUICON_ITRIM0_MASK                     equ 0004h
CTMUICON_ITRIM1_POSN                     equ 0003h
CTMUICON_ITRIM1_POSITION                 equ 0003h
CTMUICON_ITRIM1_SIZE                     equ 0001h
CTMUICON_ITRIM1_LENGTH                   equ 0001h
CTMUICON_ITRIM1_MASK                     equ 0008h
CTMUICON_ITRIM2_POSN                     equ 0004h
CTMUICON_ITRIM2_POSITION                 equ 0004h
CTMUICON_ITRIM2_SIZE                     equ 0001h
CTMUICON_ITRIM2_LENGTH                   equ 0001h
CTMUICON_ITRIM2_MASK                     equ 0010h
CTMUICON_ITRIM3_POSN                     equ 0005h
CTMUICON_ITRIM3_POSITION                 equ 0005h
CTMUICON_ITRIM3_SIZE                     equ 0001h
CTMUICON_ITRIM3_LENGTH                   equ 0001h
CTMUICON_ITRIM3_MASK                     equ 0020h
CTMUICON_ITRIM4_POSN                     equ 0006h
CTMUICON_ITRIM4_POSITION                 equ 0006h
CTMUICON_ITRIM4_SIZE                     equ 0001h
CTMUICON_ITRIM4_LENGTH                   equ 0001h
CTMUICON_ITRIM4_MASK                     equ 0040h
CTMUICON_ITRIM5_POSN                     equ 0007h
CTMUICON_ITRIM5_POSITION                 equ 0007h
CTMUICON_ITRIM5_SIZE                     equ 0001h
CTMUICON_ITRIM5_LENGTH                   equ 0001h
CTMUICON_ITRIM5_MASK                     equ 0080h

// Register: CTMUCONL
#define CTMUCONL CTMUCONL
CTMUCONL                                 equ 0F44h
// bitfield definitions
CTMUCONL_EDG1STAT_POSN                   equ 0000h
CTMUCONL_EDG1STAT_POSITION               equ 0000h
CTMUCONL_EDG1STAT_SIZE                   equ 0001h
CTMUCONL_EDG1STAT_LENGTH                 equ 0001h
CTMUCONL_EDG1STAT_MASK                   equ 0001h
CTMUCONL_EDG2STAT_POSN                   equ 0001h
CTMUCONL_EDG2STAT_POSITION               equ 0001h
CTMUCONL_EDG2STAT_SIZE                   equ 0001h
CTMUCONL_EDG2STAT_LENGTH                 equ 0001h
CTMUCONL_EDG2STAT_MASK                   equ 0002h
CTMUCONL_EDG1SEL_POSN                    equ 0002h
CTMUCONL_EDG1SEL_POSITION                equ 0002h
CTMUCONL_EDG1SEL_SIZE                    equ 0002h
CTMUCONL_EDG1SEL_LENGTH                  equ 0002h
CTMUCONL_EDG1SEL_MASK                    equ 000Ch
CTMUCONL_EDG1POL_POSN                    equ 0004h
CTMUCONL_EDG1POL_POSITION                equ 0004h
CTMUCONL_EDG1POL_SIZE                    equ 0001h
CTMUCONL_EDG1POL_LENGTH                  equ 0001h
CTMUCONL_EDG1POL_MASK                    equ 0010h
CTMUCONL_EDG2SEL_POSN                    equ 0005h
CTMUCONL_EDG2SEL_POSITION                equ 0005h
CTMUCONL_EDG2SEL_SIZE                    equ 0002h
CTMUCONL_EDG2SEL_LENGTH                  equ 0002h
CTMUCONL_EDG2SEL_MASK                    equ 0060h
CTMUCONL_EDG2POL_POSN                    equ 0007h
CTMUCONL_EDG2POL_POSITION                equ 0007h
CTMUCONL_EDG2POL_SIZE                    equ 0001h
CTMUCONL_EDG2POL_LENGTH                  equ 0001h
CTMUCONL_EDG2POL_MASK                    equ 0080h
CTMUCONL_EDG1SEL0_POSN                   equ 0002h
CTMUCONL_EDG1SEL0_POSITION               equ 0002h
CTMUCONL_EDG1SEL0_SIZE                   equ 0001h
CTMUCONL_EDG1SEL0_LENGTH                 equ 0001h
CTMUCONL_EDG1SEL0_MASK                   equ 0004h
CTMUCONL_EDG1SEL1_POSN                   equ 0003h
CTMUCONL_EDG1SEL1_POSITION               equ 0003h
CTMUCONL_EDG1SEL1_SIZE                   equ 0001h
CTMUCONL_EDG1SEL1_LENGTH                 equ 0001h
CTMUCONL_EDG1SEL1_MASK                   equ 0008h
CTMUCONL_EDG2SEL0_POSN                   equ 0005h
CTMUCONL_EDG2SEL0_POSITION               equ 0005h
CTMUCONL_EDG2SEL0_SIZE                   equ 0001h
CTMUCONL_EDG2SEL0_LENGTH                 equ 0001h
CTMUCONL_EDG2SEL0_MASK                   equ 0020h
CTMUCONL_EDG2SEL1_POSN                   equ 0006h
CTMUCONL_EDG2SEL1_POSITION               equ 0006h
CTMUCONL_EDG2SEL1_SIZE                   equ 0001h
CTMUCONL_EDG2SEL1_LENGTH                 equ 0001h
CTMUCONL_EDG2SEL1_MASK                   equ 0040h

